Repository: jimregan/citizens-information-raw
Catalog: en-ga/www.citizensinformation.ie/ga/employment/employment_and_disability/index.html.txt.tmx
Source language: en
Languages: ga

source: Life Event Document Working with a disability There are different supports for people with disabilities to help them to find and keep employment
ga: Life Event Document Ag obair faoi mhíchumas Tá tacaíochtaí difriúla ar fáil do dhaoine faoi mhíchumas le cabhrú leo fostaíocht a fháil agus a choimeád

source: Job Interview Interpreter Grant
ga: Scéim Deontais um Ateangaire ag Agallamh Poist

source: The Job Interview Interpreter Grant Scheme provides funding for people with speech and hearing impairments who want to attend job interviews
ga: Soláthraíonn an Scéim Deontais um Ateangaire ag Agallamh Poist deontas a cheadaíonn do dhaoine a bhfuil máchail éisteachta nó chainte acu, ateangaire gairmiúil a fháil a sholáthróidh seirbhísí dó/di ag an agallamh le haghaidh poist

source: Grants for employers to retain employees with disabilities
ga: Deontais do fhostóirí chun fostaithe faoi mhíchumas a choinneáil

source: The Employment Retention Grant Scheme is a scheme that aims to assist employers to retain employees who acquire an illness or impairment that affects their ability to carry out their job
ga: Is scéim í an Scéim Deontais um Fhostaíocht a Choinneáil, a bhfuil sé mar aidhm aige cabhrú le fostóirí fostaithe fostaithe a dtagann tinneas nó lagú orthu a mbíonn tionchar aige ar a gcumas a gcuid oibre a dhéanamh a choinneáil

source: Disability awareness training grants
ga: Deontais traenála le bheith ar an eolas maidir le míchumas

source: Grant aid can be provided towards the cost of training employees about disability awareness in the workplace
ga: Is féidir deontais a bheith soláthartha a chabhraíonn le costais traenála a chlúdach d’fhostaithe le hiad a chur ar an eolas maidir le daoine faoi mhíchumas san ionad oibre

source: Grants for adapting or equipping the workplace for staff with disabilities
ga: Deontais chun an láthair-oibre a chuir in oiriúint agus a áisiú do fhoireann faoi mhíchumas

source: Grant assistance is available to employees with disabilities, employers and self-employed people with disabilities who need to make adaptations to their workplace or purchase specialised equipment
ga: Tá cabhair deontais le fáil ag fostaithe faoi mhíchumas, fostóirí agus daoine féin-fhostaithe faoi mhíchumas, a dteastaíonn uathu oiriúnuithe a dhéanamh ar a láthair oibre, nó trealamh speisialta a cheannach

source: The Personal Reader grant is made available to blind or visually impaired employees that require some extra assistance with reading printed material at work
ga: Cuirtear an Deontas Léitheora Phearsanta ar fáil d'fhostaithe le amharc lagaithe nó atá dall agus a dteastaíonn roinnt cabhrach breise uathu le ábhar priontáilte a léamh ag an obair

source: The Wage Subsidy Scheme (WSS) offers financial support for employers who employ certain people with disabilities
ga: Cuireann an Scéim Fóirdheontas Tuarastail tacaíocht airgid ar fáil d'fhostóirí a fhostaíonn daoine áirithe faoi mhíchumas

source: Supported employment for people with disabilities
ga: Fostaíocht le tacaíocht do dhaoine faoi mhíchumas

source: The EmployAbility Service is a scheme aimed at assisting people with disabilities to take up paid employment
ga: Scéim é an tSeirbhís Infhostaitheachta a bhfuil sé mar aidhm aige cúnamh a thabhairt do dhaoine faoi mhíchumas fostaíocht le pá a fháil

source: Most Read in "Employment"
ga: Ábhar is mó éilimh i "Fostaíocht"

source: Rest periods and breaks
ga: Tréimhsí sosa agus sosanna

source: Tax and starting work - PAYE
ga: Gnó a chur ar bun
